#+AUTHOR:   TheCoo
#+EMAIL:    yusufyildizr@gmail.com
#+STARTUP:  showeverything





** Org-babel-load-languages configuration stuff


begin_src <asagidaki dillerden birisi>
end_src
yaparak asagidaki dilleri execute edebilirsiniz mesela ;
 
#+begin_src shell
  echo "Nart Bart Kart as"

#+end_src

#+RESULTS:
: Nart Bart Kart as

bu kisimda end_src nin sonuna imleci getirip C-c C-c yapiniz.
bize Results verecektir.
#+begin_src emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   (mapcar (lambda (lang) (cons lang t))
           `(awk
             C
             R
             calc
             clojure
             css
             ditaa
             dot
             emacs-lisp
             forth
             fortran
             gnuplot
             haskell
             java
             js
             latex
             lilypond
             lisp
             makefile
             maxima
             matlab
             ocaml
             octave
             org
             perl
             plantuml
             python
             ruby
             sass
             scheme
             screen
             sql
             sqlite
             ,(if (locate-library "ob-shell") 'shell 'sh)
             )))
  (setq org-confirm-babel-evaluate nil)
#+end_src

